[root@albert ~]# gdb /usr/lib/cyrus-imapd/imapd 30901
GNU gdb (GDB) Fedora (7.3.50.20110722-13.fc16)
Copyright (C) 2011 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /usr/lib/cyrus-imapd/imapd...Reading symbols from /usr/lib/debug/usr/lib/cyrus-imapd/imapd.debug...done.
done.
Attaching to program: /usr/lib/cyrus-imapd/imapd, process 30901
Reading symbols from /usr/lib64/libsasl2.so.2...(no debugging symbols found)...done.
Loaded symbols for /usr/lib64/libsasl2.so.2
Reading symbols from /lib64/libgssapi_krb5.so.2...Reading symbols from /usr/lib/debug/lib64/libgssapi_krb5.so.2.2.debug...done.
done.
Loaded symbols for /lib64/libgssapi_krb5.so.2
Reading symbols from /lib64/libkrb5.so.3...Reading symbols from /usr/lib/debug/lib64/libkrb5.so.3.3.debug...done.
done.
Loaded symbols for /lib64/libkrb5.so.3
Reading symbols from /lib64/libk5crypto.so.3...Reading symbols from /usr/lib/debug/lib64/libk5crypto.so.3.1.debug...done.
done.
Loaded symbols for /lib64/libk5crypto.so.3
Reading symbols from /lib64/libcom_err.so.2...(no debugging symbols found)...done.
Loaded symbols for /lib64/libcom_err.so.2
Reading symbols from /lib64/libkrb5support.so.0...Reading symbols from /usr/lib/debug/lib64/libkrb5support.so.0.1.debug...done.
done.
Loaded symbols for /lib64/libkrb5support.so.0
Reading symbols from /lib64/libdl.so.2...Reading symbols from /usr/lib/debug/lib64/libdl-2.14.90.so.debug...done.
done.
Loaded symbols for /lib64/libdl.so.2
Reading symbols from /usr/lib64/libssl.so.10...Reading symbols from /usr/lib/debug/usr/lib64/libssl.so.1.0.0h.debug...done.
done.
Loaded symbols for /usr/lib64/libssl.so.10
Reading symbols from /lib64/libcrypto.so.10...Reading symbols from /usr/lib/debug/lib64/libcrypto.so.1.0.0h.debug...done.
done.
Loaded symbols for /lib64/libcrypto.so.10
Reading symbols from /lib64/libdb-5.2.so...(no debugging symbols found)...done.
Loaded symbols for /lib64/libdb-5.2.so
Reading symbols from /lib64/libpcre.so.0...Reading symbols from /usr/lib/debug/lib64/libpcre.so.0.0.1.debug...done.
done.
Loaded symbols for /lib64/libpcre.so.0
Reading symbols from /usr/lib64/libpcreposix.so.0...Reading symbols from /usr/lib/debug/usr/lib64/libpcreposix.so.0.0.0.debug...done.
done.
Loaded symbols for /usr/lib64/libpcreposix.so.0
Reading symbols from /lib64/libz.so.1...Reading symbols from /usr/lib/debug/lib64/libz.so.1.2.5.debug...done.
done.
Loaded symbols for /lib64/libz.so.1
Reading symbols from /lib64/libwrap.so.0...(no debugging symbols found)...done.
Loaded symbols for /lib64/libwrap.so.0
Reading symbols from /lib64/libnsl.so.1...Reading symbols from /usr/lib/debug/lib64/libnsl-2.14.90.so.debug...done.
done.
Loaded symbols for /lib64/libnsl.so.1
Reading symbols from /lib64/libc.so.6...Reading symbols from /usr/lib/debug/lib64/libc-2.14.90.so.debug...done.
done.
Loaded symbols for /lib64/libc.so.6
Reading symbols from /lib64/libresolv.so.2...Reading symbols from /usr/lib/debug/lib64/libresolv-2.14.90.so.debug...done.
done.
Loaded symbols for /lib64/libresolv.so.2
Reading symbols from /lib64/libcrypt.so.1...Reading symbols from /usr/lib/debug/lib64/libcrypt-2.14.90.so.debug...done.
done.
Loaded symbols for /lib64/libcrypt.so.1
Reading symbols from /lib64/libkeyutils.so.1...(no debugging symbols found)...done.
Loaded symbols for /lib64/libkeyutils.so.1
Reading symbols from /lib64/libpthread.so.0...Reading symbols from /usr/lib/debug/lib64/libpthread-2.14.90.so.debug...done.
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib64/libthread_db.so.1".
done.
Loaded symbols for /lib64/libpthread.so.0
Reading symbols from /lib64/ld-linux-x86-64.so.2...Reading symbols from /usr/lib/debug/lib64/ld-2.14.90.so.debug...done.
done.
Loaded symbols for /lib64/ld-linux-x86-64.so.2
Reading symbols from /lib64/libselinux.so.1...(no debugging symbols found)...done.
Loaded symbols for /lib64/libselinux.so.1
Reading symbols from /lib64/libfreebl3.so...(no debugging symbols found)...done.
Loaded symbols for /lib64/libfreebl3.so
Reading symbols from /usr/lib64/sasl2/libplain.so...(no debugging symbols found)...done.
Loaded symbols for /usr/lib64/sasl2/libplain.so
Reading symbols from /usr/lib64/sasl2/libcrammd5.so...(no debugging symbols found)...done.
Loaded symbols for /usr/lib64/sasl2/libcrammd5.so
Reading symbols from /usr/lib64/sasl2/libanonymous.so...(no debugging symbols found)...done.
Loaded symbols for /usr/lib64/sasl2/libanonymous.so
Reading symbols from /usr/lib64/sasl2/libgssapiv2.so...(no debugging symbols found)...done.
Loaded symbols for /usr/lib64/sasl2/libgssapiv2.so
Reading symbols from /usr/lib64/sasl2/libdigestmd5.so...(no debugging symbols found)...done.
Loaded symbols for /usr/lib64/sasl2/libdigestmd5.so
Reading symbols from /usr/lib64/sasl2/liblogin.so...(no debugging symbols found)...done.
Loaded symbols for /usr/lib64/sasl2/liblogin.so
Reading symbols from /usr/lib64/sasl2/libsasldb.so...(no debugging symbols found)...done.
Loaded symbols for /usr/lib64/sasl2/libsasldb.so
Reading symbols from /lib64/libnss_files.so.2...Reading symbols from /usr/lib/debug/lib64/libnss_files-2.14.90.so.debug...done.
done.
Loaded symbols for /lib64/libnss_files.so.2
0x00007f3040e293e3 in __select_nocancel () at ../sysdeps/unix/syscall-template.S:82
82  T_PSEUDO (SYSCALL_SYMBOL, SYSCALL_NAME, SYSCALL_NARGS)
Missing separate debuginfos, use: debuginfo-install cyrus-sasl-gssapi-2.1.23-28.fc16.x86_64 cyrus-sasl-lib-2.1.23-28.fc16.x86_64 cyrus-sasl-md5-2.1.23-28.fc16.x86_64 cyrus-sasl-plain-2.1.23-28.fc16.x86_64 keyutils-libs-1.5.2-1.fc16.x86_64 libcom_err-1.41.14-2.fc15.x86_64 libdb-5.2.36-1.fc16.x86_64 libselinux-2.1.6-6.fc16.x86_64 nss-softokn-freebl-3.13.4-1.fc16.x86_64 tcp_wrappers-libs-7.6-64.fc16.x86_64
(gdb) b mailbox_mycreatemailboxcheck
Function "mailbox_mycreatemailboxcheck" not defined.
Make breakpoint pending on future shared library load? (y or [n]) n
(gdb) b mboxlist_mycreatemailboxcheck
Breakpoint 1 at 0x7f30436ed500: file mboxlist.c, line 301.
(gdb) cont
Continuing.

Breakpoint 1, mboxlist_mycreatemailboxcheck (mboxname=0x7fffc0846220 "user.jeroen^vanmeeuwen@kolabsys^com", partition=0x0, isadmin=1, userid=0x7f30444d02b0 "admin",
    auth_state=0x7f30444c2fc0, newacl=0x7fffc0845ed0, newpartition=0x7fffc0845ec0, RMW=1, localonly=0, force_user_create=0, new_mbtype=<optimized out>, tid=0x0) at mboxlist.c:301
301 mboxlist_mycreatemailboxcheck(const char *mboxname,
(gdb) cont
Continuing.

Breakpoint 1, mboxlist_mycreatemailboxcheck (mboxname=0x7fffc0846220 "user.jeroen^vanmeeuwen.Sent@kolabsys^com", partition=0x0, isadmin=1, userid=0x7f30444d02b0 "admin",
    auth_state=0x7f30444c2fc0, newacl=0x7fffc0845ed0, newpartition=0x7fffc0845ec0, RMW=1, localonly=0, force_user_create=0, new_mbtype=<optimized out>, tid=0x0) at mboxlist.c:301
301 mboxlist_mycreatemailboxcheck(const char *mboxname,
(gdb) n
312     char *name = xstrdup(mboxname);
(gdb) n
326     if (partition && strlen(partition) > MAX_PARTITION_LEN) {
(gdb) n
312     char *name = xstrdup(mboxname);
(gdb) n
326     if (partition && strlen(partition) > MAX_PARTITION_LEN) {
(gdb) n
329     if (config_virtdomains && (p = strchr(name, '!'))) {
(gdb)
312     char *name = xstrdup(mboxname);
(gdb)
329     if (config_virtdomains && (p = strchr(name, '!'))) {
(gdb)
333     r = mboxname_policycheck(mbox);
(gdb)
336     if (r && force_user_create != 1) return r;
(gdb) print r
$1 = <optimized out>
(gdb)
$2 = <optimized out>
(gdb) n
333     r = mboxname_policycheck(mbox);
(gdb)
336     if (r && force_user_create != 1) return r;
(gdb)
340     if(!isadmin && force_user_create) return IMAP_PERMISSION_DENIED;
(gdb) p isadmin
$3 = 1
(gdb) p force_user_create
$4 = 0
(gdb) n
339     if(!isadmin && localonly) return IMAP_PERMISSION_DENIED;
(gdb) p isadmin
$5 = 1
(gdb) p localonly
$6 = 0
(gdb) n
340     if(!isadmin && force_user_create) return IMAP_PERMISSION_DENIED;
(gdb)
339     if(!isadmin && localonly) return IMAP_PERMISSION_DENIED;
(gdb)
340     if(!isadmin && force_user_create) return IMAP_PERMISSION_DENIED;
(gdb)
343     if (mboxname_userownsmailbox(userid, name) && strchr(mbox+5, '.') &&
(gdb)
349     r = mboxlist_mylookup(name, &mbentry, tid, RMW);
(gdb)
350     switch (r) {
(gdb)
349     r = mboxlist_mylookup(name, &mbentry, tid, RMW);
(gdb)
350     switch (r) {
(gdb)
371     strlcpy(parent, name, sizeof(parent));
(gdb)
320     unsigned long parentacllen = 0;
(gdb)
319     unsigned long parentpartitionlen = 0;
(gdb)
373     while ((parentlen==0) && (p = strrchr(parent, '.')) && !strchr(p, '!')) {
(gdb)
376     r = mboxlist_mylookup(parent, &mbentry, tid, 0);
(gdb)
374     *p = '\0';
(gdb)
376     r = mboxlist_mylookup(parent, &mbentry, tid, 0);
(gdb)
377     switch (r) {
(gdb)
373     while ((parentlen==0) && (p = strrchr(parent, '.')) && !strchr(p, '!')) {
(gdb)
376     r = mboxlist_mylookup(parent, &mbentry, tid, 0);
(gdb)
374     *p = '\0';
(gdb)
376     r = mboxlist_mylookup(parent, &mbentry, tid, 0);
(gdb)
377     switch (r) {
(gdb)
373     while ((parentlen==0) && (p = strrchr(parent, '.')) && !strchr(p, '!')) {
(gdb)
397     if (!isadmin && (user_folder_limit = config_getint(IMAPOPT_USER_FOLDER_LIMIT))) {
(gdb)
412     if (parentlen != 0) {
(gdb)
436     if (!isadmin) {
(gdb)
437         return IMAP_PERMISSION_DENIED;
(gdb) p parentlen
$7 = <optimized out>
(gdb) p isadmin
$8 = 1
(gdb) p user_folder_limit
$9 = <optimized out>
(gdb) n
436     if (!isadmin) {
(gdb)
440     ouracl = xstrdup("");
(gdb)
441     if (!strncmp(mbox, "user.", 5)) {
(gdb)
440     ouracl = xstrdup("");
(gdb)
441     if (!strncmp(mbox, "user.", 5)) {
(gdb)
442         char *firstdot = strchr(mbox+5, '.');
(gdb)
443         if (!force_user_create && firstdot) {
(gdb)
442         char *firstdot = strchr(mbox+5, '.');
(gdb)
443         if (!force_user_create && firstdot) {
(gdb)
445         free(name);
(gdb)
446         free(ouracl);
(gdb)
530 }
(gdb)
mboxlist_createmailbox_full (name=0x7fffc0846220 "user.jeroen^vanmeeuwen.Sent@kolabsys^com", mbtype=0, partition=<optimized out>, isadmin=<optimized out>, userid=<optimized out>,
    auth_state=<optimized out>, options=1, uidvalidity=1335522133, copyacl=0x0, uniqueid=0x0, localonly=0, forceuser=0, dbonly=0, mboxptr=0x0) at mboxlist.c:587
587     if (r) goto done;
(gdb)
583     r = mboxlist_mycreatemailboxcheck(name, mbtype, partition, isadmin,
(gdb)
587     if (r) goto done;
(gdb)
630     if (newmailbox) {
(gdb)
636     if (acl) free(acl);
(gdb)
637     if (newpartition) free(newpartition);
(gdb)
638     if (mboxent) free(mboxent);
(gdb)
641 }
(gdb)
mboxlist_createmailbox (name=0x7fffc0846220 "user.jeroen^vanmeeuwen.Sent@kolabsys^com", mbtype=0, partition=0x0, isadmin=1, userid=<optimized out>, auth_state=<optimized out>, localonly=0,
    forceuser=0, dbonly=0) at mboxlist.c:655
655 }
(gdb)
cmd_create (tag=0x7f30444c2790 "MDBA11", name=0x7f30444c6870 "user/jeroen.vanmeeuwen/Sent@kolabsys.com", partition=0x0, localonly=0) at imapd.c:5125
5125        if (r == IMAP_PERMISSION_DENIED && !strcasecmp(name, "INBOX") &&
(gdb)
5120        r = mboxlist_createmailbox(mailboxname, 0, partition,
(gdb)
5125        if (r == IMAP_PERMISSION_DENIED && !strcasecmp(name, "INBOX") &&
(gdb)
5139        imapd_check(NULL, 0);
(gdb)
5142        prot_printf(imapd_out, "%s NO %s\r\n", tag, error_message(r));
(gdb)
5091            prot_printf(imapd_out, "%s NO %s\r\n", tag, error_message(r));
(gdb)
5151    }
(gdb)
cmdloop () at imapd.c:2096
2096        if (commandmintimer && strcmp("idle", cmdname)) {
(gdb)
1173        prot_flush(imapd_out);
(gdb)
1174        if (backend_current) prot_flush(backend_current->out);
(gdb)

